niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B021F512IM48.svd
<?xml version="1.0" encoding="UTF-8"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Silicon Labs</vendor>
  <vendorID>SLAB</vendorID>
  <name>EFR32FG23B021F512IM48</name>
  <series>EFR32</series>
  <version>C</version>
  <description>No description</description>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <dspPresent>1</dspPresent>
    <vtorPresent>1</vtorPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
    <sauNumRegions>8</sauNumRegions>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>4294967295</resetMask>
  <peripherals>
    <peripheral>
      <name>ACMP0_NS</name>
      <version>1</version>
      <description>ACMP0_NS Registers</description>
      <baseAddress>0x59008000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ACMP0</name>
        <value>41</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Module enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLING</name>
              <description>Disablement busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWRST</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RESETTING</name>
              <description>Software reset busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x00030F07</resetMask>
          <fields>
            <field>
              <name>BIAS</name>
              <description>Bias Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYST</name>
              <description>Hysteresis mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Hysteresis disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYM10MV</name>
                  <description>10mV symmetrical hysteresis</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYM20MV</name>
                  <description>20mV symmetrical hysteresis</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYM30MV</name>
                  <description>30mV symmetrical hysteresis</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS10MV</name>
                  <description>10mV hysteresis on positive edge transitions</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS20MV</name>
                  <description>20mV hysteresis on positive edge transitions</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS30MV</name>
                  <description>30mV hysteresis on positive edge transitions</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG10MV</name>
                  <description>10mV hysteresis on negative edge transitions</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG20MV</name>
                  <description>20mV hysteresis on negative edge transitions</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG30MV</name>
                  <description>30mV hysteresis on negative edge transitions</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUTRANGE</name>
              <description>Input Range</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Use this setting when the input to the comparator core can be from 0 to AVDD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REDUCED</name>
                  <description>It is recommended to use this setting when the input to the comparator core will always be less than AVDD-0.7V.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCURACY</name>
              <description>ACMP accuracy mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>ACMP operates in low-accuracy mode but consumes less current.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>ACMP operates in high-accuracy mode but consumes more current.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>NOTRDYVAL</name>
              <description>Not Ready Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>ACMP output is 0 when the ACMP is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>ACMP output is 1 when the ACMP is not ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOINV</name>
              <description>Comparator GPIO Output Invert</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTINV</name>
                  <description>The comparator output to GPIO is not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>The comparator output to GPIO is inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
