niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B021F512IM48.svd
        <register>
          <name>I2C0_SDAROUTE</name>
          <description>SDA port/pin select</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>SDA port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>SDA pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1_ROUTEEN</name>
          <description>I2C1 pin enable</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SCLPEN</name>
              <description>SCL pin enable control bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDAPEN</name>
              <description>SDA pin enable control bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1_SCLROUTE</name>
          <description>SCL port/pin select</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>SCL port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>SCL pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1_SDAROUTE</name>
          <description>SDA port/pin select</description>
          <addressOffset>0x550</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>SDA port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>SDA pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_ROUTEEN</name>
          <description>KEYSCAN pin enable</description>
          <addressOffset>0x558</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>COLOUT0PEN</name>
              <description>COLOUT0 pin enable control bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOUT1PEN</name>
              <description>COLOUT1 pin enable control bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOUT2PEN</name>
              <description>COLOUT2 pin enable control bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOUT3PEN</name>
              <description>COLOUT3 pin enable control bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOUT4PEN</name>
              <description>COLOUT4 pin enable control bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOUT5PEN</name>
              <description>COLOUT5 pin enable control bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOUT6PEN</name>
              <description>COLOUT6 pin enable control bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOUT7PEN</name>
              <description>COLOUT7 pin enable control bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT0ROUTE</name>
          <description>COLOUT0 port/pin select</description>
          <addressOffset>0x55C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT0 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT0 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT1ROUTE</name>
          <description>COLOUT1 port/pin select</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT1 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT1 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT2ROUTE</name>
          <description>COLOUT2 port/pin select</description>
          <addressOffset>0x564</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT2 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT2 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT3ROUTE</name>
          <description>COLOUT3 port/pin select</description>
          <addressOffset>0x568</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT3 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT3 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT4ROUTE</name>
          <description>COLOUT4 port/pin select</description>
          <addressOffset>0x56C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT4 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT4 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT5ROUTE</name>
          <description>COLOUT5 port/pin select</description>
          <addressOffset>0x570</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT5 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT5 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT6ROUTE</name>
          <description>COLOUT6 port/pin select</description>
          <addressOffset>0x574</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT6 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT6 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_COLOUT7ROUTE</name>
          <description>COLOUT7 port/pin select</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>COLOUT7 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>COLOUT7 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_ROWSENSE0ROUTE</name>
          <description>ROWSENSE0 port/pin select</description>
          <addressOffset>0x57C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>ROWSENSE0 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>ROWSENSE0 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_ROWSENSE1ROUTE</name>
          <description>ROWSENSE1 port/pin select</description>
          <addressOffset>0x580</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>ROWSENSE1 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>ROWSENSE1 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_ROWSENSE2ROUTE</name>
          <description>ROWSENSE2 port/pin select</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>ROWSENSE2 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>ROWSENSE2 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_ROWSENSE3ROUTE</name>
          <description>ROWSENSE3 port/pin select</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>ROWSENSE3 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>ROWSENSE3 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_ROWSENSE4ROUTE</name>
          <description>ROWSENSE4 port/pin select</description>
          <addressOffset>0x58C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>ROWSENSE4 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>ROWSENSE4 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSCAN_ROWSENSE5ROUTE</name>
          <description>ROWSENSE5 port/pin select</description>
          <addressOffset>0x590</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>ROWSENSE5 port select register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>ROWSENSE5 pin select register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LESENSE_ROUTEEN</name>
          <description>LESENSE pin enable</description>
          <addressOffset>0x598</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>CH0OUTPEN</name>
              <description>CH0OUT pin enable control bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OUTPEN</name>
              <description>CH1OUT pin enable control bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OUTPEN</name>
              <description>CH2OUT pin enable control bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3OUTPEN</name>
              <description>CH3OUT pin enable control bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4OUTPEN</name>
              <description>CH4OUT pin enable control bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5OUTPEN</name>
              <description>CH5OUT pin enable control bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6OUTPEN</name>
              <description>CH6OUT pin enable control bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7OUTPEN</name>
              <description>CH7OUT pin enable control bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH8OUTPEN</name>
              <description>CH8OUT pin enable control bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH9OUTPEN</name>
              <description>CH9OUT pin enable control bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH10OUTPEN</name>
              <description>CH10OUT pin enable control bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH11OUTPEN</name>
              <description>CH11OUT pin enable control bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH12OUTPEN</name>
              <description>CH12OUT pin enable control bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH13OUTPEN</name>
              <description>CH13OUT pin enable control bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH14OUTPEN</name>
              <description>CH14OUT pin enable control bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH15OUTPEN</name>
              <description>CH15OUT pin enable control bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
