niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B021F512IM48.svd
        <register>
          <name>BUFOUTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00643C15</resetValue>
          <resetMask>0xC0FFFFFF</resetMask>
          <fields>
            <field>
              <name>XOUTBIASANA</name>
              <description>Driver Bias Current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOUTCFANA</name>
              <description>Buffer Gain</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOUTGMANA</name>
              <description>No Description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKDETTHRESANA</name>
              <description>Peak Detector Threshold for XOUT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V105MV</name>
                  <description>V105MV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V132MV</name>
                  <description>V132MV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V157MV</name>
                  <description>V157MV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V184MV</name>
                  <description>V184MV</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V210MV</name>
                  <description>V210MV</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V236MV</name>
                  <description>V236MV</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V262MV</name>
                  <description>V262MV</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V289MV</name>
                  <description>V289MV</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V315MV</name>
                  <description>V315MV</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V341MV</name>
                  <description>V341MV</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V367MV</name>
                  <description>V367MV</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V394MV</name>
                  <description>V394MV</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V420MV</name>
                  <description>V420MV</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V446MV</name>
                  <description>V446MV</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V472MV</name>
                  <description>V472MV</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V499MV</name>
                  <description>V499MV</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUTCTUNE</name>
              <description>Tuning Cap Change Timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T2US</name>
                  <description>The tuning cap change timeout is set to 2 us minimum.  The maximum can be +40%.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T5US</name>
                  <description>The tuning cap change timeout is set to 5 us minimum.  The maximum can be +40%.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T10US</name>
                  <description>The tuning cap change timeout is set to 10 us minimum.  The maximum can be +40%.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T16US</name>
                  <description>The tuning cap change timeout is set to 16 us minimum.  The maximum can be +40%.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T21US</name>
                  <description>The tuning cap change timeout is set to 21 us minimum.  The maximum can be +40%.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T26US</name>
                  <description>The tuning cap change timeout is set to 26 us minimum.  The maximum can be +40%.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T31US</name>
                  <description>The tuning cap change timeout is set to 31 us minimum.  The maximum can be +40%.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T42US</name>
                  <description>The tuning cap change timeout is set to 42 us minimum.  The maximum can be +40%.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T52US</name>
                  <description>The tuning cap change timeout is set to 52 us minimum.  The maximum can be +40%.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T63US</name>
                  <description>The tuning cap change timeout is set to 63 us minimum.  The maximum can be +40%.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T83US</name>
                  <description>The tuning cap change timeout is set to 83 us minimum.  The maximum can be +40%.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T104US</name>
                  <description>The tuning cap change timeout is set to 104 us minimum.  The maximum can be +40%.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T208US</name>
                  <description>The tuning cap change timeout is set to 208 us minimum.  The maximum can be +40%.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T313US</name>
                  <description>The tuning cap change timeout is set to 313 us minimum.  The maximum can be +40%.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T521US</name>
                  <description>The tuning cap change timeout is set to 521 us minimum.  The maximum can be +40%.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T938US</name>
                  <description>The tuning cap change timeout is set to 938 us minimum.  The maximum can be +40%.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUTSTARTUP</name>
              <description>Oscillator Startup Timeout</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T42US</name>
                  <description>The oscillator startup timeout is set to 42 us minimum.  The maximum can be +40%.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T83US</name>
                  <description>The oscillator startup timeout is set to 83 us minimum.  The maximum can be +40%.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T108US</name>
                  <description>The oscillator startup timeout is set to 108 us minimum.  The maximum can be +40%.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T133US</name>
                  <description>The oscillator startup timeout is set to 133 us minimum.  The maximum can be +40%.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T158US</name>
                  <description>The oscillator startup timeout is set to 158 us minimum.  The maximum can be +40%.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T183US</name>
                  <description>The oscillator startup timeout is set to 183 us minimum.  The maximum can be +40%.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T208US</name>
                  <description>The oscillator startup timeout is set to 208 us minimum.  The maximum can be +40%.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T233US</name>
                  <description>The oscillator startup timeout is set to 233 us minimum.  The maximum can be +40%.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T258US</name>
                  <description>The oscillator startup timeout is set to 258 us minimum.  The maximum can be +40%.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T283US</name>
                  <description>The oscillator startup timeout is set to 283 us minimum.  The maximum can be +40%.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T333US</name>
                  <description>The oscillator startup timeout is set to 333 us minimum.  The maximum can be +40%.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T375US</name>
                  <description>The oscillator startup timeout is set to 375 us minimum.  The maximum can be +40%.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T417US</name>
                  <description>The oscillator startup timeout is set to 417 us minimum.  The maximum can be +40%.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T458US</name>
                  <description>The oscillator startup timeout is set to 458 us minimum.  The maximum can be +40%.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T500US</name>
                  <description>The oscillator startup timeout is set to 500 us minimum.  The maximum can be +40%.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T667US</name>
                  <description>The oscillator startup timeout is set to 667 us minimum.  The maximum can be +40%.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINIMUMSTARTUPDELAY</name>
              <description>Minimum Startup Delay</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>COREBIASOPT</name>
              <description>Core Bias Optimizaton</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC03F800F</resetMask>
          <fields>
            <field>
              <name>RDY</name>
              <description>Ready Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COREBIASOPTRDY</name>
              <description>Core Bias Optimization Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRSRDY</name>
              <description>PRS Ready Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFOUTRDY</name>
              <description>BUFOUT Ready Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFOUTFROZEN</name>
              <description>BUFOUT Frozen</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENS</name>
              <description>Enabled Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HWREQ</name>
              <description>Oscillator Requested by Digital Clock</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISWARM</name>
              <description>Oscillator Is Kept Warm</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRSHWREQ</name>
              <description>Oscillator Requested by PRS Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFOUTHWREQ</name>
              <description>Oscillator Requested by BUFOUT Request</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCBUSY</name>
              <description>Sync Busy</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Configuration Lock Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>Configuration lock is unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Configuration lock is locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF830800F</resetMask>
          <fields>
            <field>
              <name>RDY</name>
              <description>Digital Clock Ready Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COREBIASOPTRDY</name>
              <description>Core Bias Optimization Ready Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSRDY</name>
              <description>PRS Ready Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTRDY</name>
              <description>BUFOUT Ready Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTFROZEN</name>
              <description>BUFOUT FROZEN Interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSERR</name>
              <description>PRS Requset Error Interrupt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTERR</name>
              <description>BUFOUT Request Error Interrupt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTFREEZEERR</name>
              <description>BUFOUT Freeze Error Interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTDNSERR</name>
              <description>BUFOUT Did Not Start Error Interrupt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNSERR</name>
              <description>Did Not Start Error Interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFTIMEOUTERR</name>
              <description>Low Frequency Timeout Error Interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COREBIASOPTERR</name>
              <description>Core Bias Optimization Error Interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
