niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B021F512IM48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD_S</name>
      <version>1</version>
      <description>LCD_S Registers</description>
      <baseAddress>0x400AC000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD</name>
        <value>72</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IPVERSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLING</name>
              <description>Disablement busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWRST</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software reset command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RESETTING</name>
              <description>Software reset busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00100000</resetValue>
          <resetMask>0x7F1D0006</resetMask>
          <fields>
            <field>
              <name>UDCTRL</name>
              <description>Update Data Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>The data transfer is controlled by SW. Transfer is performed as soon as possible on the next CTRL.PRESCALE clock.  This is primarily available for debug only since only some of the new SEGMENT data may be ready by the time of the UPDATE.  This should not be used with interrupts since partially updating SEGMENT data may have indeterminant results.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMESTART</name>
                  <description>Data is loaded continuously at every frame start</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCEVENT</name>
                  <description>The data transfer is done at the next Frame Counter event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISPLAYEVENT</name>
                  <description>The data transfer is done at the next Display Counter event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSC</name>
              <description>Direct Segment Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DSC disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DSC enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WARMUPDLY</name>
              <description>Warmup Delay</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WARMUP1</name>
                  <description>1mswarm up </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARMUP31</name>
                  <description>31ms warm up</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARMUP63</name>
                  <description>62ms warm up</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARMUP125</name>
                  <description>125ms warm up</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARMUP250</name>
                  <description>250ms warm up</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARMUP500</name>
                  <description>500ms warm up</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARMUP1000</name>
                  <description>1000ms warm up</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARMUP2000</name>
                  <description>2000ms warm up</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Presclae</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Load command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLEAR</name>
              <description>Clear command</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DISPCTRL</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00100000</resetValue>
          <resetMask>0x03700017</resetMask>
          <fields>
            <field>
              <name>MUX</name>
              <description>Mux Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATIC</name>
                  <description>Static</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUPLEX</name>
                  <description>Duplex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIPLEX</name>
                  <description>Triplex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUADRUPLEX</name>
                  <description>Quadruplex</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAVE</name>
              <description>Waveform Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Type B waveform</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Type A waveform</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHGRDST</name>
              <description>Charge Redistribution Cycles</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable charge redistribution.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Use 1 prescaled low frequency clock cycle for charge redistribution.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Use 2 prescaled low frequency clock cycles for charge redistribution.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Use 3 prescaled low frequency clock cycles for charge redistribution.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Use 4 prescaled low frequency clock cycles for charge redistribution.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIAS</name>
              <description>Bias Configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATIC</name>
                  <description>Static</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEHALF</name>
                  <description>1/2 Bias</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONETHIRD</name>
                  <description>1/3 Bias</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEFOURTH</name>
                  <description>1/4 Bias</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BACFG</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x00FF0007</resetMask>
          <fields>
            <field>
              <name>ASTATETOP</name>
              <description>ASTATE top cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCPRESC</name>
              <description>Frame Counter Prescaler</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>every frame clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>every 2nd frame clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>every 4th frame clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>every 8th frame clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCTOP</name>
              <description>Frame Counter Top </description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACTRL</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x100003FF</resetMask>
          <fields>
            <field>
              <name>BLINKEN</name>
              <description>Blink Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANK</name>
              <description>Blank Display</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Display is not "blanked"</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Display is "blanked"</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEN</name>
              <description>Animation Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AREGASC</name>
              <description>Animate Register A Shift Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSHIFT</name>
                  <description>No Shift operation on Animation Register A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFTLEFT</name>
                  <description>Animation Register A is shifted left</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFTRIGHT</name>
                  <description>Animation Register A is shifted right</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AREGBSC</name>
              <description>Animate Register B Shift Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSHIFT</name>
                  <description>No Shift operation on Animation Register B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFTLEFT</name>
                  <description>Animation Register B is shifted left</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFTRIGHT</name>
                  <description>Animation Register B is shifted right</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALOGSEL</name>
              <description>Animate Logic Function Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AND</name>
                  <description>AREGA and AREGB AND'ed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OR</name>
                  <description>AREGA and AREGB OR'ed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCEN</name>
              <description>Frame Counter Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPLAYCNTEN</name>
              <description>Display Counter Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the display counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the display counter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALOC</name>
              <description>Animation Location</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEG0TO7</name>
                  <description>Animation appears on segments 0 to 7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG8TO15</name>
                  <description>Animation appears on segments 8 to 15</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000090F</resetMask>
          <fields>
            <field>
              <name>ASTATE</name>
              <description>Current Animation State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLINK</name>
              <description>Blink State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOADBUSY</name>
              <description>Load Synchronization is busy</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
